# CSE422: Introduction to Pandas
---


Pandas is an open-source easy-to-use python library for data manipulation and analysis.

DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dictionary of Series objects.

#Series : First main data type in Pandas

In [ ]:

import pandas as pd
labels =['a','b','c']
my_data=[10,20,30]

d={'a':10,'b':10,'c':30}

In [ ]:
pd.Series(d)

a    10
b    10
c    30
dtype: int64

#DataFrame

In [ ]:

import numpy as np

x=np.random.randint(100,size=(5,4)) 
print("Numpy Array:")
x

Numpy Array:

array([[83, 30, 95, 89],
       [43, 21, 90, 24],
       [23, 53, 74, 58],
       [54, 63, 20, 86],
       [12, 99, 50, 38]])

In [ ]:

import pandas as pd
df = pd.DataFrame(x)
print("Pandas DataFrame:")
df

Pandas DataFrame:

    0   1   2   3
0  83  30  95  89
1  43  21  90  24
2  23  53  74  58
3  54  63  20  86
4  12  99  50  38

In [ ]:

df = pd.DataFrame(x,['x','b','c','d','e'],['W','X','Y','Z'])
print("Pandas DataFrame with custom indexing:")
df

Pandas DataFrame with custom indexing:

    W   X   Y   Z
x  83  30  95  89
b  43  21  90  24
c  23  53  74  58
d  54  63  20  86
e  12  99  50  38

In [ ]:
df['X']

x    30
b    21
c    53
d    63
e    99
Name: X, dtype: int64

In [ ]:
#ENTERING ANATHER COLUMN IN A DATAFRAME
df['new_col']=[1,2,3,4,5]
df

    W   X   Y   Z  new_col
x  83  30  95  89        1
b  43  21  90  24        2
c  23  53  74  58        3
d  54  63  20  86        4
e  12  99  50  38        5

In [ ]:
#how delete column in dataframe:
df.drop('Y',axis=1,inplace=True)
print(df)

    W   X   Z  new_col
x  83  30  89        1
b  43  21  24        2
c  23  53  58        3
d  54  63  86        4
e  12  99  38        5

In [ ]:
#how delete column in dataframe:
df.drop('c',axis=0,inplace=True)
print(df)

    W   X   Z  new_col
x  83  30  89        1
b  43  21  24        2
d  54  63  86        4
e  12  99  38        5

#Importing pandas library and reading a CSV file into a dataframe.

In [ ]:
 df = pd.read_csv('/content/sample_data/sales.csv',index_col='month')
 df.head()

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52

# Indexing DataFrames

## Indexing using square brackets

In [ ]:
df = pd.read_csv('/content/sample_data/sales.csv',index_col='month')
df.head()

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52

In [ ]:
 df['eggs']['Mar'] # df[column]['rows']
 type(df)

pandas.core.frame.DataFrame

In [ ]:
df.eggs['Apr']

77

Using column atribute and row index/label

In [ ]:
df.salt['Apr']

87.0

Selecting only some columns

In [ ]:
df_new = df[['salt','spam']]
df_new

       salt  spam
month
Jan    12.0    17
Feb    50.0    31
Mar    89.0    72
Apr    87.0    20
May     NaN    52
Jun    60.0    55

Selecting a column (i.e., Series)

In [ ]:
 df['eggs']

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [ ]:
#printing type of the column selected
type(df['eggs'])

pandas.core.series.Series

Slicing and indexing a Series

In [ ]:
#selecting part of a series
df['eggs'][1:4]

month
Feb    110
Mar    221
Apr     77
Name: eggs, dtype: int64

In [ ]:
df['eggs'][4]

132

# Slicing DataFrames

Using the .loc accessor
* Access a group of rows and columns by label(s) or a boolean array.

A series is a 1D-array that can store any data type

* LOC is not based on index. The stop limit is **not** exclusive
* ILOC is based on index. The stop limit is exclusive

In [ ]:
#we can access row by 2 ways:
# 1. location based selection .loc('rowname')
# 2. numerical based selection  iloc(rowindex)
df2 = pd.DataFrame(x,['x','b','c','d','e'],['W','X','Y','Z'])
df2.loc[:,'X']

x    30
b    21
c    53
d    63
e    99
Name: X, dtype: int64

In [ ]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [ ]:
df.loc['Feb':'Mar','eggs':'salt']

       eggs  salt
month
Feb     110  50.0
Mar     221  89.0

In [ ]:
df.loc['Feb',:]   #df.loc[rows,column]

eggs    110.0
salt     50.0
spam     31.0
Name: Feb, dtype: float64

In [ ]:
 df.loc['Jan': 'Mar', ['eggs','spam']]

       eggs  spam
month
Jan      47    17
Feb     110    31
Mar     221    72

In [ ]:
df.loc[:, ['eggs','salt']]   # All rows, some columns

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

In [ ]:
 df.loc['Jan':'Apr',:]  # Some rows, all columns

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20

In [ ]:
df.loc['Mar':'May', 'salt':'spam']

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

Using the .iloc accessor
* Purely integer-location based indexing for selection by position.

In [ ]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [ ]:
df.iloc[2]  #indexwise
df.iloc[2,2]

72

In [ ]:
 df.iloc[2:4, 2]

month
Mar    72
Apr    20
Name: spam, dtype: int64

In [ ]:
 df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [ ]:
df.iloc[2:5, 1:] # A block from middle of the DataFrame

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

Using lists rather than slices (1)

In [ ]:
df.loc['Jan':'May', ['eggs','salt']]

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN

Using lists rather than slices (2)

In [ ]:
df.iloc[[0,4,5], 0:2]

       eggs  salt
month
Jan      47  12.0
May     132   NaN
Jun     205  60.0

Series versus 1-column DataFrame

In [ ]:
 df['eggs']

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [ ]:
type(df['eggs'])

pandas.core.series.Series

In [ ]:
df[['eggs']]

       eggs
month
Jan      47
Feb     110
Mar     221
Apr      77
May     132
Jun     205

In [ ]:
type(df[['eggs']])

pandas.core.frame.DataFrame

#Filtering DataFrames

Creating a Boolean Series

In [ ]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [ ]:
df['salt'] > 60

month
Jan    False
Feb    False
Mar     True
Apr     True
May    False
Jun    False
Name: salt, dtype: bool

Filtering with a Boolean Series

In [ ]:
df.salt > 60

month
Jan    False
Feb    False
Mar     True
Apr     True
May    False
Jun    False
Name: salt, dtype: bool

In [ ]:
a = df.salt > 60

In [ ]:
type(a) #this is a series

pandas.core.series.Series

In [ ]:
df[a]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

In [ ]:
df[df.salt>60]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

Combining filters

In [ ]:
(df.salt >= 50) & (df.eggs < 200)

month
Jan    False
Feb     True
Mar    False
Apr     True
May    False
Jun    False
dtype: bool

In [ ]:
 df[(df.salt >= 50) & (df.eggs < 200)] # Both conditions

       eggs  salt  spam
month
Feb     110  50.0    31
Apr      77  87.0    20

In [ ]:
(df.salt >= 50) | (df.eggs < 200)

month
Jan    True
Feb    True
Mar    True
Apr    True
May    True
Jun    True
dtype: bool

In [ ]:
 df[(df.salt >= 50) | (df.eggs < 200)] # Either condition

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

#DataFrame Append

In [ ]:
df2 = df.copy()
df2

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [ ]:
 df2['bacon']=[0,0,60,0,90,100]
 df2

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     60
Apr      77  87.0    20      0
May     132   NaN    52     90
Jun     205  60.0    55    100

In [ ]:
df3=df2.copy()
df3

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     60
Apr      77  87.0    20      0
May     132   NaN    52     90
Jun     205  60.0    55    100

In [ ]:
other = pd.DataFrame({'eggs': ['K0', 'K1', 'K2'],
                      'salt': ['b10', 'b20', 'b50'],
                      'spam': ['s1', 's2', 's3'],
                      'bacon': ['bc0', 'bc1', 'cb2']},index=["July", "Aug", "Sept"])
other

     eggs salt spam bacon
July   K0  b10   s1   bc0
Aug    K1  b20   s2   bc1
Sept   K2  b50   s3   cb2

In [ ]:
df2.append(other)

     eggs salt spam bacon
Jan    47   12   17     0
Feb   110   50   31     0
Mar   221   89   72    60
Apr    77   87   20     0
May   132  NaN   52    90
Jun   205   60   55   100
July   K0  b10   s1   bc0
Aug    K1  b20   s2   bc1
Sept   K2  b50   s3   cb2

In [ ]:
df3

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     60
Apr      77  87.0    20      0
May     132   NaN    52     90
Jun     205  60.0    55    100

In [ ]:
df3.columns=['X', 'Y', 'Z','T']
df3

         X     Y   Z    T
month
Jan     47  12.0  17    0
Feb    110  50.0  31    0
Mar    221  89.0  72   60
Apr     77  87.0  20    0
May    132   NaN  52   90
Jun    205  60.0  55  100

In [ ]:
df3.drop("T",axis=1,inplace=True)
df3

         X     Y   Z
month
Jan     47  12.0  17
Feb    110  50.0  31
Mar    221  89.0  72
Apr     77  87.0  20
May    132   NaN  52
Jun    205  60.0  55

#DataFrames with zeros and NaNs

Select columns with all nonzeros

In [ ]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [ ]:

df['bacon']=[0,0,0,0,0,1]
df['bacon'].any()

True

In [ ]:
df

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72      0
Apr      77  87.0    20      0
May     132   NaN    52      0
Jun     205  60.0    55      1

In [ ]:

df.loc[:, df.all()]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

Select columns with any NaNs

In [ ]:
df.loc[:, df.isnull().any()]

       salt
month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May     NaN
Jun    60.0

Select columns without NaNs

In [ ]:
df

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72      0
Apr      77  87.0    20      0
May     132   NaN    52      0
Jun     205  60.0    55      1

In [ ]:
df.loc[:, df.notnull().any()]

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72      0
Apr      77  87.0    20      0
May     132   NaN    52      0
Jun     205  60.0    55      1

Drop rows with any NaNs

In [ ]:
df.dropna(how='any')

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72      0
Apr      77  87.0    20      0
Jun     205  60.0    55      1

In [ ]:
from google.colab import drive
drive.mount('/content/drive',)

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
df

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72      0
Apr      77  87.0    20      0
May     132   NaN    52      0
Jun     205  60.0    55      1

In [ ]:
df.salt > 55

month
Jan    False
Feb    False
Mar     True
Apr     True
May    False
Jun     True
Name: salt, dtype: bool

Filtering a column based on another

In [ ]:
df.eggs[df.salt > 55]  #returns a series

month
Mar    221
Apr     77
Jun    205
Name: eggs, dtype: int64